tutorials/incompressible/simpleFoam/turbulentFlatPlate/0.kEpsilon/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            zeroGradient;
/*
        type            totalPressure;
        rho             none;
        psi             none;
        p0              uniform 1.02828;
        value           uniform 1.02828;
*/
    }

    outlet
    {
        type            fixedValue;
        value           uniform 0;
/*
        type            fixedValue;
        value           uniform 1;
*/
    }

    topWall
    {
        type            zeroGradient;
    }
    
    bottomWall
    {
        type            zeroGradient;
    }

    symmetry
    {
        type            symmetryPlane;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
